[
  {
    "id": "VES",
    "title": "Software Engineer (AI/ML)", 
    "subheader": "VES LLC",
    "link": "https://www.socom.mil/st/Pages/JATF.aspx",
    "location": "Tampa, FL",
    "duration": "April 2024 to Present",
    "tasks": [
      "Acted as Lead AI SME with rapid-prototyping team, informing leadership of quality of AI technology/vendors. ",
      "Led development and integration of AI-based solutions to reduce cognitive load of military operators in a variety of areas, including computer vision, object character recognition, image processing, and edge compute solutions.  ", 
      "Served as AI/ML SME and JATF representative while traveling on tech-scouting events, networking with industry professionals and identifying companies for integration with SOCOM-wide impact.",
      "Aggregated and organized publicly available data to build and deploy computer vision models on edge compute devices for mission-critical impact.  "
    ]
  },
  {
    "id": "RackN",
    "title": "AI/ML Intern",
    "subheader": "Retrieval-Augmented Generative Chatbot",
    "link": "https://www.rackn.com",
    "location": "Freehold, NJ",
    "duration": "April 2023 to April 2024",
    "tasks": [
      "Spearheaded the creation, launch, and management of RackGPT, an AI chatbot aiming to reduce customer support tickets by 20% and boost user productivity by 15% on the Digital Rebar UX platform.",
      "Utilized Langchain, OpenAI products, and HuggingFace to build and optimize RackGPT, and implemented Langchain to improve information retrieval and enhance RackGPT's performance.",
      "Developed and deployed generative (T5, GPT) machine learning models and products, both internally and externally, to support the organization's goals.",
      "Evaluated the model's performance using appropriate metrics and testing methodologies.",
      "Ensured models are integrated into the organization's infrastructure and systems."
    ]
  },
  {
    "id": "ViViHealth",
    "title": "Data Scientist Intern",
    "subheader": "Craving Detection Algorithm",
    "link": "https://www.vivihealth.com",
    "location": "Newark, NJ",
    "duration": "September 2023 to December 2023",
    "tasks": [
      "Utilized SQL and Python to analyze and consolidate large datasets from ViviHealth's Google BigQuery database.",
      "Maintained thorough documentation of data sources, methods, and code for transparency.",
      "Implemented 8–10 machine learning models to identify the most predictive one and created a deployment plan for implementing the Craving Detection model into ViviHealth's systems.",
      "Developed predictive and classification models using machine learning algorithms and evaluated model performance using appropriate metrics.",
      "Developed expertise in the specific domain or industry to better understand the context of data and business objectives."
    ]
  },
  {
    "id": "BigDataRhino",
    "title": "Data Scientist Intern", 
    "subheader": "Route Optimization Algorithm",
    "link": "https://bigdatarhino.com/en-us/home",
    "location": "Freehold, NJ",
    "duration": "October 2022 to April 2023",
    "tasks": [
      "Spearheaded the creation and deployment of advanced machine learning applications in the oil and gas sector for operational optimization, cost reduction, and improved efficiency.",
      "Directed client meetings to showcase machine learning expertise, resolve queries, and promote collaboration.",
      "Produced impactful data visualizations with PowerBI and Tableau for industry insights and authored insightful articles on carbon emissions and ML solutions.",
      "Cleaned and preprocessed data to ensure its quality, consistency, and suitability for analysis.",
      "Interpreted and communicated the results of data analyses to both technical and non-technical audiences."
    ]
  }
]
